TIMESHIFT = 1667250000
BRAND_COLORS = [
    "[bold magenta]",
    "[bold red]",
    "[bold blue]",
    "[bold yellow]",
    "[bold green]",
]

LOGO_ENGINE = """\
{0}╭───╮ ╭─╮{1}       {2}╭──────╮  {3}╭───────╮{4}╭───────╮\n
{0}│   │ │ │{1}       {2}│   ╭─╮│  {3}│       │{4}│       │\n
{0}│   ╰─╯ │{1}╭────╮ {2}│   │ ││  {3}│   ╭─╮ │{4}│   ╭───╯\n
{0}│     ╭─╯{1}╰────╯ {2}│   ╰─╯╰─╮{3}│   ╰─╯ │{4}│   │╭──╮\n
{0}│     ╰─╮{1}       {2}│   ╭──╮ │{3}│   ╭───╯{4}│   ││  │\n
{0}│   ╭─╮ │{1}       {2}│   │  │ │{3}│   │    {4}│   ╰╯  │\n
{0}╰───╯ ╰─╯{1}       {2}╰───╯  ╰─╯{3}╰───╯    {4}╰───────╯\n\
""".format(
    *BRAND_COLORS
)
LOGO_GAME = """\
{3}┌┐ ┌─┐┬ ┬┌─┐┌┐┌┌┬┐  {2}┌─┐┬ ┬┬┌─┐┬  ┌┬┐  ┐  {1}┌─┐┌─┐┬ ┬┌─┐┌─┐┌─┐
{3}├┴┐├┤ └┬┘│ ││││ ││  {2}└─┐├─┤│├┤ │   ││     {1}├┤ │  ├─┤│ │├┤ └─┐
{3}└─┘└─┘ ┴ └─┘┘└┘─┴┘  {2}└─┘┴ ┴┴└─┘┴─┘─┴┘  └  {1}└─┘└─┘┴ ┴└─┘└─┘└─┘\
""".format(
    *BRAND_COLORS
)

ABOUT = "Ты оказываешься в мире, где древние силы и скрытые враги угрожают самому существованию защищенного города. Тебя обвиняют в предательстве, но впереди — путь к правде, тайнам магии и давно забытым артефактам. Выбирай свои  способности, сражайся и оберегай свою душу, чтобы противостоять темным силам, что пытаются нарушить границы реальности."
