__version__ = "1.4.0"
TIMESHIFT = 1667250000
BRAND_COLORS = [
    "[bold magenta]",
    "[bold red]",
    "[bold blue]",
    "[bold yellow]",
    "[bold green]",
]
ABOUT_TEXT = "[b black on green]\nВас ждет увлекательное путешествие по миру, где Вы               \n\nбудете сражаться с монстрами, выполнять квесты и становиться все \n\nсильнее и сильнее. Сможете ли Вы стать настоящим героем?         [/][green]\n\n\nАвтор:             [magenta]Kotaz[/]\n\nСайт:              [blue u]https://kotazzz.github.io/ [/]\n\nРепозиторий:       [blue u]https://github.com/kotazzz/krpg [/]\n\n                   [blue  ]Дайте ⭐ плиз [/]\n\nDiscord:           [blue u]https://discord.gg/FKcURWZsMW [/]\n\n                   [blue  ]@kot_az[/]\n\nTelegram:          [blue  ]@kot_az[/]\n\nЯзык:              [magenta]Python 3[/]\n\nБиблиотеки:        [red]rich[/], [red]prompt_toolkit[/], [red]msgpack[/]\n\nКол-во строк кода: [magenta]4000+[/]\n\n\nЛицензия:          [magenta]MIT[/][/]\n\n\n[bold green]Отдельная благодарность:[/]\n\n  [green]Никто (извините.)[/]\n\n  [red]Конец[/]\n\n"
FAQ = {
    "FAQ": "Тут пусто :(",
    "Changelog": "Мне [red]лень[/] тут что-то писать... :( \n",
    "Мне нужна помощь по командам": "Используйте [green]help[/] или [green]guide[/] для получения справки\n\n",
    "[blue][AUTO][/] и аргументы": "В игре все действия используют лишь одну фразу или слово. \nУ них нет аргументов или какого либо синтаксиса. \nЕсли для определенного действия требуются аргументы - \nони будут запрошенные через отдельные поля ввода. Теперь \nвам не надо заучивать сложный синтаксис дял простых действий. \nХотите ввести аргументы сразу? Разделяйте свои действия пробелом. \nИгра запоминает каждое слово отдельно и как только понадобится что-то \nввести она сама вставит то, что вы вводили ранее. \nТаким образом вы можете одновременно вводить множество \nкоманд за раз и они все исполнятся сами\n\nПопробуйте ввести [green]e guide 1[/] и вы выйдете из \nсправки и вернетесь, открыв первую страницу\n    ",
}
