__version__ = "1.2.0"
TIMESHIFT = 1667250000
BRAND_COLORS = [
    "[bold magenta]",
    "[bold red]",
    "[bold blue]",
    "[bold yellow]",
    "[bold green]",
]
ABOUT_TEXT = """\
[b black on green]
Вас ждет увлекательное путешествие по миру, где Вы               \n
будете сражаться с монстрами, выполнять квесты и становиться все \n
сильнее и сильнее. Сможете ли Вы стать настоящим героем?         [/][green]\n\n
Автор:             [magenta]Kotaz[/]\n
Сайт:              [blue u]https://kotazzz.github.io/ [/]\n
Репозиторий:       [blue u]https://github.com/kotazzz/krpg [/]\n
                   [blue  ]Дайте ⭐ плиз [/]\n
Discord:           [blue u]https://discord.gg/FKcURWZsMW [/]\n
                   [blue  ]@kot_az[/]\n
Telegram:          [blue  ]@kot_az[/]\n
Язык:              [magenta]Python 3[/]\n
Библиотеки:        [red]rich[/], [red]prompt_toolkit[/], [red]msgpack[/]\n
Кол-во строк кода: [magenta]4000+[/]\n\n
Лицензия:          [magenta]MIT[/][/]\n\n
[bold green]Отдельная благодарность:[/]\n
  [green]Никто (извините.)[/]\n
  [red]Конец[/]\n
"""
FAQ = {
    "FAQ": ("Тут пусто :("),
    "Changelog": ("Мне [red]лень[/] тут что-то писать... :( \n"),
    "Мне нужна помощь по командам": """\
Используйте [green]help[/] или [green]guide[/] для получения справки\n
""",
    "[blue][AUTO][/] и аргументы": """\
В игре все действия используют лишь одну фразу или слово. 
У них нет аргументов или какого либо синтаксиса. 
Если для определенного действия требуются аргументы - 
они будут запрошенные через отдельные поля ввода. Теперь 
вам не надо заучивать сложный синтаксис дял простых действий. 
Хотите ввести аргументы сразу? Разделяйте свои действия пробелом. 
Игра запоминает каждое слово отдельно и как только понадобится что-то 
ввести она сама вставит то, что вы вводили ранее. 
Таким образом вы можете одновременно вводить множество 
команд за раз и они все исполнятся сами\n
Попробуйте ввести [green]e guide 1[/] и вы выйдете из 
справки и вернетесь, открыв первую страницу
    """,
}
